/* ====================================================================== */
/* Auth Dialog */

/* ---------------------------------------------------------------------- */
/* Window Titles */
"ENTER_CREDENTIALS" = "Syötä valtakirjat";
"CONNECT_TO_SERVER" = "Yhdistä palvelimeen";
"PRINTER_AUTH" = "Tulostimen todentaminen";
"SCREEN_SHARE_AUTH" = "Jaa näyttö";

/* ---------------------------------------------------------------------- */
/* Auth Dialog Messages */

/* Generic Connect */
"GENERIC_MSG_BOTH" = "Syötä käyttäjätunnus ja salasana kohteeseen ”%@” yhdistämiseen.";
"GENERIC_MSG_PASS" = "Syötä salasana kohteeseen “%@” yhdistämiseen.";
"GENERIC_MSG_NONAME" = "Syötä käyttäjätunnus ja salasana.";

/* Protocol Specific */
"AFP_MSG" = "Syötä käyttäjätunnus ja salasana palvelimelle ”%@”.";
"SMB_MSG" = "Syötä käyttäjätunnus ja salasana palvelimelle ”%@”.";
"FTP_MSG" = "Syötä käyttäjätunnus ja salasana palvelimelle ”%@”.";
"WEBDAV_MSG" = "Syötä käyttäjätunnus ja salasana palvelimelle ”%@”.";

/* File Server */
"FS_MSG_BOTH" = "Syötä käyttäjätunnus ja salasana palvelimelle ”%@”.";
"FS_MSG_PASS" = "Syötä salasana palvelimelle ”%@”.";

/* Generic Server */
"SRV_MSG_BOTH" = "Syötä käyttäjätunnus ja salasana palvelimelle ”%@”.";
"SRV_MSG_PASS" = "Syötä salasana palvelimelle ”%@”.";

/* Printer */
"PRINT_MSG_BOTH" = "Syötä käyttäjätunnus ja salasana tulostimelle ”%@”.";
"PRINT_MSG_PASS" = "Syötä salasana tulostimelle ”%@”.";

/* Print Server */
"PS_MSG_BOTH" = "Syötä käyttäjätunnus ja salasana tulostinpalvelimelle ”%@”.";
"PS_MSG_PASS" = "Syötä käyttäjätunnus ja salasana tulostinpalvelimelle ”%@”.";

/* Screen Sharing */
"SS_MSG_BOTH" = "Syötä käyttäjätunnus ja salasana näytön ”%@” jakamiseen.";
"SS_MSG_PASS" = "Syötä salasana näytön ”%@” jakamiseen.";

"VS_MSG_BOTH" = "Syötä käyttäjätunnus ja salasana näytön ”%@” katselemiseen.";
"VS_MSG_PASS" = "Syötä salasana näytön ”%@” katselemiseen.";

/* Time Machine */
"TM_MSG_BOTH" = "Syötä käyttäjätunnus ja salasana palvelimelle ”%@”, jotta Time Machine voi käyttää sitä.";
"TM_MSG_PASS" = "Syötä salasana palvelimelle ”%@”, jotta Time Machine voi käyttää sitä.";

/* Pre Auth */
"PA_MSG_BOTH" = "Syötä käyttäjätunnus ja salasana välipalvelimelle ”%@”.";
"PA_MSG_PASS" = "Syötä salasana välipalvelimelle ”%@”.";


/* ---------------------------------------------------------------------- */
/* Auth Dialog Buttons */
"CONNECT" = "Yhdistä";
"SHARE" = "Jaa";
"PRINT" = "Tulosta";
"VIEW" = "Katsele";
"OK" = "OK";

"CONNECT_AS" = "Yhdistä tunnuksella:";
"GUEST" = "Vieraana";
"REGISTERED_USER" = "Rekisteröitynä käyttäjänä";

"CONNECT_BY" = "Yhdistä:";
"BY_ASKING_FOR_PERMISSION" = "Kysymällä lupaa";
"AS_REGISTERED_USER" = "Rekisteröitynä käyttäjänä";


/* ---------------------------------------------------------------------- */
/* Tool Tips */
"TOOLTIP_NAME_SMB" = "Domain\\Käyttäjätunnus";

/* ====================================================================== */
/* Share Picker Messages */
"SELECT_VOLUME_ON_SERVER" = "Valitse taltiot, jotka haluat tuoda näkyviin palvelimella ”%@”:";
"SELECT_VOLUME" = "Valitse näkyviin tuotavat taltiot:";

"SELECT_PRINTER_ON_SERVER" = "Valitse tulostin palvelimella ”%@”:";

/* ---------------------------------------------------------------------- */
/* default western encoding name */
"WESTERN_MAC" = "Länsimainen (Mac)";


/* ====================================================================== */
/* Change Password */
"CHANGE_PASSWORD_MSG" = "Vaihda kohteen ”%1$@” salasana sijainnissa ”%2$@”.";


/* ====================================================================== */
/* Progress Dialog */
"CONNECTING_TO_GENERIC" = "Yhdistetään…";
"CONNECTING_TO_HOST" = "Yhdistetään palvelimeen ”%@”.";


/* ====================================================================== */
/* Volume Password */
"ENTER_VOLUME_PASSWORD_FOR_SERVER" = "Syötä salasana kohteelle ”%@” tiedostopalvelimella ”%@”.";
"ENTER_VOLUME_PASSWORD" = "Syötä salasana kohteelle ”%@”.";


/* ====================================================================== */
/* Keychain Kinds */
"NETWORK_PASSWORD" = "Verkon salasana";
"PRINT_PASSWORD" = "Tulostimen salasana";
"AFP_PASSWORD" = "AFP-salasana";
"SMB_PASSWORD" = "SMB-salasana";
"FTP_PASSWORD" = "FTP-salasana";
"WEBDAV_PASSWORD" = "WebDAV-salasana";
"VNC_PASSWORD" = "VNC-salasana";


/* ====================================================================== */
/* ---------------------------------------------------------------------- */
/* Error Message Text */
"EMSG_OCCURRED" = "Tapahtui virhe.";
"EMSG_INVALID_PWD" = "Syötit virheellisen salasanan.";
"EMSG_INVALID_NAME_PWD" = "Syötetty käyttäjätunnus tai salasana on virheellinen.";
"EMSG_PWD_EXPIRED" = "Salasana on vanhentunut.";
"EMSG_PWD_NEEDS_CHANGE" = "Salasana on vaihdettava.";
"EMSG_PWD_POLICY" = "Salasana ei täytä palvelimen vaatimuksia.";
"EMSG_CONNECTION_FAILED" = "Yhteys epäonnistui";

"EMSG_MOUNT_FAILURE" = "Taltion näkyviin tuominen epäonnistui.";

/* ---------------------------------------------------------------------- */
/* Error Info Text */
"EINFO_TRY_AGAIN" = "Yritä uudelleen.";
"EINFO_CONTACT_ADMIN" = "Lisätietoja saat järjestelmän ylläpitäjältä.";

"EINFO_NO_ACCESS_USER" = "Sinulla ei ole oikeutta käyttää palvelinta ”%@”.";
"EINFO_NO_ACCESS_GUEST" = "Palvelin ”%@” ei salli käyttöä vieraana.";
"EINFO_SAME_MACHINE" = "Palvelin ”%@” on saatavilla tässä tietokoneessa. Käytä taltioita ja tiedostoja paikallisesti.";
"EINFO_NO_SERVER" = "Palvelinta ”%@” ei ehkä ole olemassa tai se ei ole saatavilla tällä hetkellä. Tarkista palvelimen nimi tai IP-osoite sekä verkkoyhteys ja yritä uudelleen.";
"EINFO_TOO_MANY_USERS" = "Palvelin ”%@” ei salli enää useampien käyttäjien kirjautua sisään. Yritä myöhemmin uudelleen.";
"EINFO_GENERAL" = "Yhdistettäessä palvelimeen ”%@” tapahtui virhe. Tarkista palvelimen nimi tai IP-osoite ja yritä uudelleen.\n\nJos et onnistu ratkaisemaan ongelmaa, ota yhteyttä järjestelmän ylläpitäjään.";
"EINFO_NO_SHARES" = "Jakoja ei ole käytettävissä tai sinulla ei ole pääsyä palvelimen ”%@” jakoihin. Ota yhteyttä järjestelmän ylläpitäjään ongelman ratkaisemiseksi.";

"EINFO_NO_ACCESS_USER_UNKNOWN" = "Sinulla ei ole oikeutta käyttää palvelinta.";
"EINFO_NO_ACCESS_GUEST_UNKNOWN" = "Tämä palvelin ei salli käyttöä vieraana.";
"EINFO_SAME_MACHINE_UNKNOWN" = "Tämä tiedostopalvelin on saatavilla tässä tietokoneessa. Käytä taltioita ja tiedostoja paikallisesti.";
"EINFO_NO_SERVER_UNKNOWN" = "Palvelinta ei ehkä ole olemassa tai se ei ole saatavilla tällä hetkellä. Tarkista palvelimen nimi tai IP-osoite sekä verkkoyhteys ja yritä uudelleen.";
"EINFO_TOO_MANY_USERS_UNKNOWN" = "Tiedostopalvelin ei salli enää useampien käyttäjien kirjautua sisään. Yritä myöhemmin uudelleen.";
"EINFO_GENERAL_UNKNOWN" = "Yhdistettäessä palvelimeen tapahtui virhe. Tarkista palvelimen nimi tai IP-osoite ja yritä uudelleen.\n\nJos et onnistu ratkaisemaan ongelmaa, ota yhteyttä järjestelmän ylläpitäjään.";
"EINFO_NO_SHARES_UNKNOWN" = "Jakoja ei ole käytettävissä tai sinulla ei ole pääsyä palvelimen jakoihin. Ota yhteyttä järjestelmän ylläpitäjään ongelman ratkaisemiseksi.";

"EINFO_UNKNOWN_MOUNT_FAILED" = "Tuotaessa taltiota näkyviin tapahtui virhe.";
"EINFO_ONE_MOUNT_FAILED" = "Taltiota ”%@” ei voitu tuoda näkyviin.";
"EINFO_MULTIPLE_MOUNTS_FAILED" = "Seuraavia taltioita ei voitu tuoda näkyviin:";
